In [7]:
import pandas as pd
import numpy as np

### 缺失数据相关操作
- isnull判定是否有缺失数据NaN
- notnull判断是否无空
- fillna填充缺失
- dropna删除缺失值
- replace替换缺失值

In [2]:
data = pd.read_csv('data/movie.csv')

**np.any(data.isnull())只要有一个NaN就返回True，即只要返回True，就证明有空值**

In [14]:
# data.isnull()判断是否有NaN，返回数据shape，NaN为True，否则为False
# numpy any 任意True，为True
np.any(data.isnull())

True

**np.all(data.notnull())只有全非NaN才返回True，即只要返回False，就证明有空值**

In [13]:
# data.notnull()判断是否无NaN，返回数据shape，NaN为False，否则为True
# numpy all 全True，为True
np.all(data.notnull())

False

In [29]:
# 删除所有NaN
df = pd.DataFrame([
    [pd.NA, 1, 2],
    [pd.NA, 4, 5],
    [6, 7, 8]
])
df.isnull()

       0      1      2
0   True  False  False
1   True  False  False
2  False  False  False

In [32]:
droped = df.dropna()
droped

   0  1  2
2  6  7  8

In [31]:
df

      0  1  2
0  <NA>  1  2
1  <NA>  4  5
2     6  7  8

In [35]:
# 填充数据到NaN
filled = df.fillna(0)
filled

   0  1  2
0  0  1  2
1  0  4  5
2  6  7  8

In [34]:
df

      0  1  2
0  <NA>  1  2
1  <NA>  4  5
2     6  7  8

In [40]:
# 填充到原来位置, 不返回新数据，更改原数据
filled2 = df.fillna(0, inplace=True)
filled2

In [41]:
df

   0  1  2
0  0  1  2
1  0  4  5
2  6  7  8

In [42]:
df1 = pd.DataFrame([
    [pd.NA, 1, 2],
    [pd.NA, 4, 5],
    [6, 7, 8]
])
df1

      0  1  2
0  <NA>  1  2
1  <NA>  4  5
2     6  7  8

In [44]:
# 替换数据NaN, replace(to_replace, value) 
# to_replace 要替换的值
# value 替换为的值
df1.replace(to_replace=pd.NA, value=0)

   0  1  2
0  0  1  2
1  0  4  5
2  6  7  8

In [45]:
df1

      0  1  2
0  <NA>  1  2
1  <NA>  4  5
2     6  7  8